OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0_59ac345/examples/iot/tcp/client/main.c
    if (m_tcp_state == TCP_STATE_TCP_SEND_PENDING)
    {
        return;
    }

    uint32_t len = tcp_sndbuf(p_pcb);

    APPL_LOG ("Available TCP length 0x%08lx", len);

    if (len >= TCP_DATA_SIZE)
    {
        m_sequence_number++;

        //Register callback to get notification of data reception is complete.
        tcp_sent(p_pcb, tcp_write_complete);
        uint8_t tcp_data[TCP_DATA_SIZE];

        tcp_data[0] = (uint8_t )((m_sequence_number >> 24) & 0x000000FF);
        tcp_data[1] = (uint8_t )((m_sequence_number >> 16) & 0x000000FF);
        tcp_data[2] = (uint8_t )((m_sequence_number >> 8)  & 0x000000FF);
        tcp_data[3] = (uint8_t )(m_sequence_number         & 0x000000FF);

        tcp_data[4] = 'P';
        tcp_data[5] = 'i';
        tcp_data[6] = 'n';
        tcp_data[7] = 'g';

        //Enqueue data for transmission.
        err = tcp_write(p_pcb, tcp_data, TCP_DATA_SIZE, 1);

        if (err != ERR_OK)
        {
            APPL_LOG ("Failed to send TCP packet, reason %d", err);
            m_sequence_number--;
        }
        else
        {
            m_tcp_state = TCP_STATE_TCP_SEND_PENDING;
            APPL_LOG ("Data TX, Sequence number 0x%08lx", m_sequence_number);
        }
    }
    else
    {
        APPL_LOG ("No room to send next request, available length 0x%08lx", len);
    }


    APPL_LOG ("<< TCP TX Data.");
}


/**@brief Callback registered for receiving data on the TCP Port.
 *
 * @param[in]   p_arg     Receive argument set on the TCP port.
 * @param[in]   p_pcb     TCP PCB on which data is received.
 * @param[in]   p_buffer  Buffer with received data.
 * @param[in]   err       Event result indicating error associated with the receive,
 *                        if any, else ERR_OK.
 */
err_t tcp_recv_data_handler(void           * p_arg,
                            struct tcp_pcb * p_pcb,
                            struct pbuf    * p_buffer,
                            err_t            err)
{
    APPL_LOG (">> TCP Data.");

    //Check event result before proceeding.
    if (err == ERR_OK)
    {
        uint8_t *p_data = p_buffer->payload;

        if (p_buffer->len == TCP_DATA_SIZE)
        {
            uint32_t rx_seq_number = 0;

            rx_seq_number  = ((p_data[0] << 24) & 0xFF000000);
            rx_seq_number |= ((p_data[1] << 16) & 0x00FF0000);
            rx_seq_number |= ((p_data[2] << 8)  & 0x0000FF00);
            rx_seq_number |= (p_data[3]         & 0x000000FF);

            LEDS_OFF(ALL_APP_LED);

            if (rx_seq_number & 0x00000001)
            {
                LEDS_ON(DISPLAY_LED_0);
            }
            if (rx_seq_number & 0x00000002)
            {
                LEDS_ON(DISPLAY_LED_1);
            }
            if (rx_seq_number & 0x00000004)
            {
                LEDS_ON(DISPLAY_LED_2);
            }
            if (rx_seq_number & 0x00000008)
            {
                LEDS_ON(DISPLAY_LED_3);
            }

            if (rx_seq_number != m_sequence_number)
            {
                APPL_LOG ("Mismatch in sequence number.");
            }
        }
        // All is good with the data received, process it.
        tcp_recved(p_pcb, p_buffer->tot_len);
        UNUSED_VARIABLE(pbuf_free(p_buffer));
    }
    else
    {
        //Free the buffer in case its not NULL.
        if (p_buffer != NULL)
        {
            UNUSED_VARIABLE(pbuf_free(p_buffer));
        }
    }

    return ERR_OK;
}


/**@brief Callback registered To be notified of errors on the TCP ports.
 *
 * @param[in]   p_arg     Receive argument set on the port.
 * @param[in]   err       Indication of nature of error that occurred on the port.
 */
static void tcp_error_handler(void *p_arg, err_t err)
{
    LWIP_UNUSED_ARG(p_arg);
    LWIP_UNUSED_ARG(err);

    APPL_LOG ("Error on TCP port, reason 0x%08lx", err);
}


/**@brief TCP Poll Callback.
 *
 * @details Callback registered for TCP port polling, currently does nothing.
 *
 * @param[in]   p_arg     Receive argument set on the port.
 * @param[in]   p_pcb     PCB identifier of the port.
 *
 * @retval ERR_OK.
 */
static err_t tcp_connection_poll(void *p_arg, struct tcp_pcb *p_pcb)
{
    LWIP_UNUSED_ARG(p_arg);
    LWIP_UNUSED_ARG(p_pcb);

    return ERR_OK;
}


/**@brief TCP Port Connection Callback.
 *
 * @details Callback registered with TCP for connection complete. err indicates if the
 * @param[in]   p_arg     Receive argument set on the port.
 * @param[in]   p_pcb     PCB identifier of the port.
 * @param[in]   err       Event result indicating error associated with the receive,
 *                        if any, else ERR_OK.
 */
static err_t tcp_connection_callback(void           * p_arg,
                                     struct tcp_pcb * p_pcb,
                                     err_t            err)
{
    APPL_LOG (">> TCP Connected, result 0x%08X.", err);

    //Ensure connection establishment was successful.
    APP_ERROR_CHECK(err);

    //Set the state of TCP port and associated handlers/information.
    m_tcp_state = TCP_STATE_CONNECTED;

    tcp_setprio(p_pcb, TCP_PRIO_MIN);
    tcp_arg(p_pcb, NULL);
    tcp_recv(p_pcb, tcp_recv_data_handler);
    tcp_err(p_pcb, tcp_error_handler);
    tcp_poll(p_pcb, tcp_connection_poll, 0);

    LEDS_ON(TCP_CONNECTED_LED);

    return ERR_OK;
}


/**@brief Setup TCP Port.
 *
 * @details Set up TCP Port and register receive callback.
 */
static void tcp_port_setup(void)
{
    ip6_addr_t any_addr;
    ip6_addr_set_any(&any_addr);

    mp_tcp_port = tcp_new_ip6();

    if (mp_tcp_port != NULL)
    {
        err_t err = tcp_bind(mp_tcp_port, &any_addr, TCP_CLIENT_PORT);
        APP_ERROR_CHECK(err);
    }
    else
    {
        ASSERT(0);
    }
}


/**@brief Request TCP Port Connection.
 *
 * @details Request TCP Port Connection, connection procedure is complete when
 *          tcp_connected_callback called.
 */
void tcp_request_connection(void)
{
    err_t err = tcp_connect(mp_tcp_port, &m_remote_addr, TCP_SERVER_PORT, tcp_connection_callback);
    APP_ERROR_CHECK(err);
    APPL_LOG(">> TCP Connection Requested.");
}


/**@brief Function for initializing IP stack.
 *
 * @details Initialize the IP Stack and its driver.
 */
static void ip_stack_init(void)
{
    uint32_t err_code;

    err_code = ipv6_medium_eui64_get(m_ipv6_medium.ipv6_medium_instance_id,
                                     &eui64_local_iid);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_mem_init();
    APP_ERROR_CHECK(err_code);

    //Initialize LwIP stack.
    lwip_init();

